Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: If you want to trap errors when loading an XS module, some problems with the binary interface (such as Perl version skew) may be fatal even with C<eval> unless C<$ENV{PERL_DL_NONLAZY}> is set.
es_es: Si desea capturar los errores cuando se carga un módulo XS, algunos problemas con la interfaz binaria (como el sesgo de versión de Perl) puede ser fatal, incluso con C<eval> a menos que C<$ENV{PERL_DL_NONLAZY}> esté puesto.

source: or from the command line:
es_es: o desde la línea de comandos:

source: To keep the string the same length, you may need to pad or chop your value using C<sprintf>.
es_es: Para mantener la cadena de la misma longitud, puede ser necesario rellenar o recortar su valor con C<sprintf>.

source: A contact email address for the author/maintainer
es_es: Una dirección de correo electrónico de contacto del autor/mantenedor

source: we prevent backtracking and find the count of the longest matching string at each matching starting point like so:
es_es: evitamos la vuelta atrás y hacemos el recuento de la cadena más larga coincidente en cada punto inicial de la coincidencia, como se ve:

source: Binary compatibility with 5.8.0 has been restored in 5.8.2, which necessitates breaking compatibility with 5.8.1.
es_es: La compatibilidad binaria con 5.8.0 ha sido restaurada en 5.8.2, que requiere romper la compatibilidad con 5.8.1.

source: Omit redundant punctuation as long as clarity doesn't suffer.
es_es: Omitir la puntuación redundante mientras no se reduzca la claridad.

source: The snazzle() function will behave in the most spectacular
es_es: La función snazzle() se convertirá en la más espectacular

source: Matching operations can have various modifiers.
es_es: Las operaciones de coincidencia pueden tener varios modificadores.

source: The null list contains no elements, so when the password file is exhausted, the result is 0, not 2.
es_es: La lista vacía no contiene elementos, así que cuando el archivo de contraseñas se acaba, el resultado es 0, no 2.

source: Categories of modules range from text manipulation to network protocols to database integration to graphics.
es_es: Las categorías de módulos abarcan desde la manipulación de texto hasta protocolos de red, integración de bases de datos o gráficos.

source: @data = <FILE>;
es_es: @data = <ARCHIVO>;

source: Ideally, someone who's slightly familiar with your module should be able to refresh their memory without hitting "page down".
es_es: Lo ideal sería que alguien que está un poco familiarizado con el módulo debería ser capaz de refrescar su memoria sin tener que pulsar el "avance de página".

source: Provide sensible defaults for parameters which have them.
es_es: Proporcione parámetros por defecto para los parámetros que los tengan.

source: If you change them, Perl won't even notice.)
es_es: Si las cambia, Perl ni siquiera se dará cuenta.)

source: =head2 OS groups
es_es: =head2 Agrupación de SO

source: i A signed integer value.
es_es: i Un valor entero con signo.

source: Searches a string for a pattern match, and in scalar context returns true if it succeeds, false if it fails.
es_es: Busca una cadena para una coincidencia de patrones, y en un contexto escalar devuelve verdadero si tiene éxito, falso si falla.

source: If what the angle brackets contain is a simple scalar variable (e.g., <$foo>), then that variable contains the name of the filehandle to input from, or its typeglob, or a reference to the same.
es_es: Si lo que los ángulos contienen es una variable escalar simple (por ejemplo, <$foo>), entonces esa variable contiene el nombre del identificador de archivo desde el qué recibir la entrada, o su I<typeglob>, o una referencia al mismo.

source: See L<perlport>, your port's specific documentation, and your system-specific local manpages for details.
es_es: Vea L<perlport>, la documentación específica de su adaptación Perl, y sus páginas de manual locales, para los detalles.

source: In this case, the yes-pattern is never directly executed, and no no-pattern is allowed.
es_es: En este caso, el patrón-sí no se ejecuta nunca directamente, y no se permite un patrón-no.

source: Many operations return C<undef> to indicate failure, end of file, system error, uninitialized variable, and other exceptional conditions.
es_es: Muchas operaciones devuelven C<undef> para indicar un error, fin de archivo, error del sistema, variable no inicializada u otras condiciones excepcionales.

source: =item substr EXPR,OFFSET,LENGTH
es_es: =item substr EXPR,DESPLAZAMIENTO,LONGITUD

source: perlnumber Perl number semantics
es_es: perlnumber Semántica de números

source: The C<tr> operator is not equivalent to the tr(1) utility.
es_es: El operador C<tr> no es equivalente a la utilidad tr(1).

source: =item package NAMESPACE BLOCK
es_es: =item package ESPACIO_NOMBRES BLOQUE

source: This aspect of C<values> is considered highly experimental.
es_es: Este aspecto de C<values> es considerado altamente experimental.

source: Attempts to read LENGTH I<characters> of data into variable SCALAR from the specified FILEHANDLE.
es_es: Intento de leer LONGITUD I<caracteres> de datos en la variable ESCALAR del IDENTIFICADOR_ARCHIVO especificado.

source: If the test lib/ftmp-security gives you as a result something like
es_es: Si la prueba lib/ftmp-security da como resultado algo como

source: This is now fixed; now C<no warnings 'io';> will only turn off warnings in the C<io> class.
es_es: Esto ha sido corregido; ahora C<no warnings 'io';> sólo desactivará las advertencias en la clase C<io>.

source: default { say "I don't like anything"
es_es: default { say "No me gusta nada"

source: Note that, despite what may be implied in I<"Programming Perl"> (the Camel, 3rd edition) or elsewhere, C<:raw> is I<not> simply the inverse of C<:crlf>.
es_es: Note que, a pesar de estar implícito en I<"Programming Perl"> (el dromedario, 3ª edición) o en otro lugar, C<:raw> I<no> es el simplemente el inverso de C<:crlf>

source: Second, ensure you've found an actual bug.
es_es: Cuando esté seguro, confírmelo otra vez.

source: For example, C<int(-6.725/0.025)> produces -268 rather than the correct -269; that's because it's really more like -268.99999999999994315658 instead.
es_es: Por ejemplo, C<int(-6.725/0.025)> produce -268 en vez del valor correcto -269; esto es porque el valor realmente es -268.99999999999994315658.

source: This set of characters is just a recommendation; the characters allowed in the salt depend solely on your system's crypt library, and Perl can't restrict what salts C<crypt()> accepts.
es_es: Este conjunto de caracteres es sólo una recomendación; los caracteres permitidos en el salto dependen solamente de la función crypt del sistema y Perl no puede restringir el salto que C<crypt()> acepte.

source: A scalar may contain one single value in any of three different flavors: a number, a string, or a reference.
es_es: Un escalar puede contener un único valor perteneciente a un tipo de entre tres distintos: un número, una cadena o una referencia.

source: Starting with Perl 5.14, C<values> can take a scalar EXPR, which must hold a reference to an unblessed hash or array.
es_es: A partir de Perl 5.14, C<values> puede tomar una EXPR escalar, que debe contener la referencia a un hash o un array no bendecido.

source: For a description of this, see L<perlref>.
es_es: Para una descripción de ésto, vea L<perlref>.

source: F<a2p> converts F<awk> scripts to Perl programs; for example, C<a2p -F:> on the simple F<awk> script C<{print $2}> will produce a Perl program based around this code:
es_es: F<a2p> convierte scripts F<awk> en programas Perl; por ejemplo, si ejecuta C<a2p -F:> sobre el sencillo script F<awk> C<{print $2}>, generará un programa Perl basado en el código siguiente:

source: Note that C<\N> has two meanings.
es_es: Tenga en cuenta que C<\N> tiene dos significados.

source: See L<the sort pragma|sort>.
es_es: Ver L<el pragma sort|sort>.

source: if ($some_condition) {
es_es: if ($una_condicion) {

source: Takes a LIST of values and converts it into a string using the rules given by the TEMPLATE.
es_es: Toma una LISTA de valores y la convierte en una cadena usando las reglas dadas por la PLANTILLA.

source: Unlike i, m, s and x, these two flags affect the way the regex is used rather than the regex itself.
es_es: A diferencia de i, m, s y x, estos dos indicadores afectan a la forma en que se utiliza la expresión regular en lugar de la propia expresión regular.

source: Creates an unnamed pair of sockets in the specified domain, of the specified type.
es_es: Crea un par de sockets anónimos en el dominio especificado, del tipo especificado.

source: translates a list of numbers to their squared values.
es_es: traduce una lista de números a sus valores al cuadrado.

source: Using C<eval>/C<die> always works, modulo the caveats given in L<perlipc/"Signals">.
es_es: Usando C<eval>/C<die> siempre funciona, teniendo en cuenta las advertencias dadas en L<perlipc/"Señales">.

source: Returns like ioctl: C<undef> for error; "C<0> but true" for zero; and the actual return value otherwise.
es_es: Devuelve lo mismo que ioctl: C<undef> para error; "C<0> but true" para cero; o el valor de retorno real, en cualquier otro caso.

source: Be aware that setting C<@DB::args> is I<best effort>, intended for debugging or generating backtraces, and should not be relied upon.
es_es: Tenga en cuenta que fijar C<@DB::args> es I<el mejor esfuerzo>, destinado a la depuración o la generación de seguimientos, y no debería ser invocado.

source: The first element of the list must be the numeric mode, which should probably be an octal number, and which definitely should I<not> be a string of octal digits: C<0644> is okay, but C<"0644"> is not.
es_es: El primer elemento de la lista debe ser un modo numérico, que normalmente estará en octal, y que, definitivamente, I<no> debe ser una cadena de dígitos en octal: C<0644> es correcto, C<"0644"> no lo es.

source: F<splain> is an interface to L<perldiag> - paste in your error message to it, and it'll explain it for you.
es_es: F<splain> es una interfaz de L<perldiag>; si pega un mensaje de error, mostrará una descripción.

source: If LENGTH is not specified, writes whole SCALAR.
es_es: Si LONGITUD no se especifica, escribe todo el ESCALAR.

source: The bundled version is 2.06_01.
es_es: La versión incluida es la 2.06_01.

source: When we say "Mac OS" below, we mean Mac OS 7, 8, and 9, and I<not> Mac OS X.
es_es: Cuando decimos bajo "Mac OS", queremos decir Mac OS 7, 8 y 9, y I<no> Mac OS X.

source: Consider two possible matches, C<AB> and C<A'B'>, C<A> and C<A'> are substrings which can be matched by C<S>, C<B> and C<B'> are substrings which can be matched by C<T>.
es_es: Consideremos dos posibles coincidencias, C<AB> y C<A'B'>, C<A> y C<A'> son subcadenas que pueden coincidir con C<S>; C<B> y C<B'> son subcadenas que pueden coincidir con C<T>.

source: open(IN, $ARGV[0]) || die "can't open $ARGV[0]: $!";
es_es: open(IN, $ARGV[0]) || die "no puedo abrir $ARGV[0]: $!";

source: Sets the current position to the beginning of the directory for the C<readdir> routine on DIRHANDLE.
es_es: Establece la posición actual al comienzo del directorio para la rutina C<readdir> en IDENTIFICADOR_DIR.

source: delete() may also be used on arrays and array slices, but its behavior is less straightforward.
es_es: delete() puede usarse también en lo arrays y porciones de array, pero su comportamiento es menos claro.

source: Every CPAN module has a bug tracker set up in RT, http://rt.cpan.org . You can submit bugs to RT either through its web interface or by email.
es_es: Todo módulo de CPAN tiene un sistema de seguimiento de errores configurado en RT, http://rt.cpan.org . Puede enviar informes de error a RT por correo electrónico o a través de su interfaz web.

source: Also, ithreads were made less memory-intensive.
es_es: Además, ithreads se ha hecho menos intenso con el consumo de memoria.

source: In almost all cases like this, it's usually a far, far better idea to use the structured control flow mechanisms of C<next>, C<last>, or C<redo> instead of resorting to a C<goto>.
es_es: En casi todos los casos como este, es usualmente una mejor, mucho mejor idea, usar los mecanismos de control de flujo de C<next>, C<last> o C<redo> en vez de recurrir a C<goto>.

source: There may not be a space between the C<< << >> and the identifier, unless the identifier is explicitly quoted.
es_es: No es necesario un espacio entre el C<< << >> y el identificador, a menos que el identificador esté explícitamente entrecomillado.

source: This is known as B<Do What I Mean>, abbreviated B<DWIM>.
es_es: Esto es conocido como B<Do What I Mean> (haz lo que te digo), abreviado como B<DWIM>.

source: (If the entry doesn't exist you get the undefined value.) For example:
es_es: (Si la entrada no existe obtendrá el valor indefinido). Por ejemplo:

source: I said bar.
es_es: He dicho bar.

source: While we usually think of quotes as literal values, in Perl they function as operators, providing various kinds of interpolating and pattern matching capabilities.
es_es: Mientras solemos solemos pensar de lo entrecomillado como si fueran valores literales, en Perl funcionan como operadores, ofreciendo diversos tipos de interpolación y capacidades de coincidencia de patrones.

source: If C<A> and C<A'> coincide: C<AB> is a better match than C<AB'> if C<B> is a better match for C<T> than C<B'>.
es_es: Si C<A> y C<A'> coinciden: C<AB> es una mejor coincidencia que C<AB'> si C<B> es un mejor coincidencia para C<T> que C<B'>.

source: See README.os400.
es_es: Vea README.os400.

source: =head1 New Tests
es_es: =head1 Nuevas pruebas

source: =item Provide sensible shortcuts and defaults.
es_es: =item Proporcione atajos y valores por defecto razonables.

source: The perl interpreter is now more tolerant of UTF-16-encoded scripts.
es_es: El intérprete perl es ahora más tolerante con los script codificados en UTF-16.

source: This has been the behaviour in the cygwin.com build for years.
es_es: Este ha sido el comportamiento en la compilación de cygwin.com desde hace años.

source: $_ = "The brown fox jumps over the lazy dog";
es_es: $_ = "El zorro marrón saltó sobre el perezoso perro";

source: If an input filehandle is marked C<:utf8> and Perl sees illegal UTF-8 coming in when doing C<< <FH> >>, if warnings are enabled a warning is immediately given - instead of being silent about it and Perl being unhappy about the broken data later.
es_es: Si un identificador de archivo de entrada es marcado como C<:utf8> y Perl ve UTF-8 ilegal cuando hace C<< <FH> >>, si las advertencias están activadas, se levanta inmediatamente una advertencia - en lugar de callar y dejar Perl descontento con el resto de datos estropeados.

source: $foo = q!I said, "You said, 'She said it.'"!;
es_es: $foo = q!Yo dije, "Tu dijiste, 'Ella dijo.'"!;

source: On most platforms, you will have to protect shell metacharacters if you want them treated literally.
es_es: En la mayoría de plataformas, tendrá que proteger los metacaracteres de shell, si quiere que ellos sean tratados literalmente.

source: For a more rigorous (and complicated) view of the rules involved in selecting a match among possible alternatives, see L<Combining RE Pieces>.
es_es: Para un análisis más riguroso (y complicado punto de vista) de las normas involucradas en la selección de una coincidencia entre las alternativas posibles, vea L<Combinando piezas RE>.

source: # code
es_es: # código

source: say 'a complicated check for $foo is true';
es_es: say 'una confirmación complicada para $foo es cierta';

source: keys(%users) = 1000; # allocate 1024 buckets
es_es: keys(%usuarios) = 1000; # reserva 1024 cajones

source: The number of lines remaining on the current page is in variable C<$->, which can be set to C<0> to force a new page.
es_es: El número de líneas restantes de la página actual está en la variable C<$->, que se puede fijar a C<0> para forzar una nueva página.

source: What about adding new columns?
es_es: ¿Qué pasa con la adición de nuevas columnas?

source: m{ \( ( (?> [^()]+ ) # change x+ above to (?> x+ ) | \( [^()]* \) )+
es_es: m{ \( ( (?> [^()]+ ) # cambiar x+ anterior a (?> x+ ) | \( [^()]* \) )+

source: # for speed
es_es: # para aumentar la velocidad

source: The expression C<glob(".* *")> matches all files in the current working directory.
es_es: La expresión C<glob(".* *")> coincide con todos los archivos en el directorio de trabajo actual.

source: Most implementations of C<srand> take an integer and will silently truncate decimal numbers.
es_es: La mayoría de las implementaciones de C<srand> toman un número entero y silenciosamente truncará los números decimales.

source: Now C<use customre> enables the new escape in constant regular expressions, i.e., those without any runtime variable interpolations.
es_es: Ahora C<use customre> permite usar el nuevo escape en expresiones regulares constantes, es decir, aquellas que no tienen ninguna interpolación de variables en tiempo de ejecución.

source: =head2 OO Perl
es_es: =head2 Perl orientado a objetos

source: Returns the packed address if it succeeded, false otherwise.
es_es: Devuelve la dirección empaquetada si ha tenido éxito, de lo contrario, falso.

# print join(':', split(//, 'hi there')), " ";
source: print join(':', split(//, 'hi there')), "\n";
es_es: print join(':', split(//, 'hola por aqui')), "\n";

source: If you find what you think is a bug, you might check the articles recently posted to the comp.lang.perl.misc newsgroup and the perl bug database at http://bugs.perl.org/ . There may also be information at http://www.perl.org/ , the Perl Home Page.
es_es: Si encuentra algo que piensa que es un error, podría verificar los artículos publicados recientemente en el grupo de noticias comp.lang.perl.misc y la base de datos de errores de perl en http://bugs.perl.org/ . Hay también información en la página principal de Perl, http://www.perl.org/ .

source: @new = sort other::backwards @old;
es_es: @nuevo = sort otro::al_reves @viejo;

source: =head2 Constant Folding X<constant folding> X<folding>
es_es: =head2 Plegado de constantes X<constant folding> X<folding> X<plegado de constantes> X<plegado>

source: POSITION and the return value are based at C<0> (or whatever you've set the C<$[> variable to--but don't do that).
es_es: POSICIÓN y el valor devuelto están basados en C<0> (o al valor indicado por la variable C<$[>, pero no lo haga, por favor).

source: The argument will be dereferenced automatically.
es_es: El argumento es desreferenciado automáticamente.

source: Beginning with v5.6.0, Perl attempts to flush all files opened for output before forking the child process, but this may not be supported on some platforms (see L<perlport>).
es_es: A partir de la versión v5.6.0, Perl intentará vaciar todos los archivos abiertos para salida antes de crear un proceso hijo, pero esto puede no estar soportado en algunas plataformas (ver L<perlport>).

source: Because this promotes strange action at a distance, this counterintuitive behavior may be fixed in a future release.
es_es: Debido a que provoca una acción extraña a gran distancia, este comportamiento no intuitivo puede ser arreglado en una distribución futura.

source: Does the same thing as the C<stat> function (including setting the special C<_> filehandle) but stats a symbolic link instead of the file the symbolic link points to.
es_es: hace lo mismo que la función C<stat> (incluyendo el establecimiento del identificador de archivo especial C<_>) pero de un enlace simbólico en lugar del archivo apuntado por el enlace simbólico.

source: See also L<perlport>.
es_es: Vea también L<perlport>.

source: Finally, keep in mind that Perl might not be the right tool for every job.
es_es: Por último, tenga en cuenta que Perl puede no ser la herramienta adecuada para algunas tareas.

source: print ((1+2)+4); # Prints 7.
es_es: print ((1+2)+4); # Imprime 7.

source: The days of just flinging strings around are over.
es_es: Actualmente ya no es posible trabajar con cadenas de texto de manera irreflexiva.

# 'aaab' =~ /a+b?(?{print "$& "; $count++})(*FAIL)/;
source: 'aaab' =~ /a+b?(?{print "$&\n"; $count++})(*FAIL)/;
es_es: 'aaab' =~ /a+b?(?{print "$&\n"; $contador++})(*FAIL)/;

source: This may substantially slow your program.
es_es: Esto puede ralentizar sustancialmente el programa.

source: perl591delta Perl changes in version 5.9.1
es_es: perl591delta Cambios en la versión 5.9.1

source: delete @{$ref->[$x][$y]}[$index1, $index2, @moreindices];
es_es: delete @{$ref->[$x][$y]}[$indice1, $indice2, @masindices];

# print "r is not a reference at all. ";
source: print "r is not a reference at all.\n";
es_es: print "r no es una referencia.\n";

source: the value of the last evaluated expression of the successful C<when>/C<default> clause, if there's one.
es_es: el valor de la última expresión evaluada de la exitosa cláusula C<when>/C<default>, si hay alguna.

source: It's equivalent to C<&&> except for the very low precedence.
es_es: Es equivalente a "&&" excepto por tener una precedencia muy baja.

source: Beware that unlike C<split>, C<join> doesn't take a pattern as its first argument.
es_es: Cuidado que, a diferencia de C<split>, C<join> no toma un patrón como su primer argumento.

source: The next call following that one restarts iteration.
es_es: La siguiente llamada reinicia la iteración.

source: Again, see L</exec>.
es_es: Una vez más, vea L</exec>.

source: Now it works both ways.
es_es: Ahora funciona de las dos maneras.

source: =head1 RELEASE CONSIDERATIONS
es_es: =head1 CONSIDERACIONES DEL LANZAMIENTO

source: This section needs a rewrite.
es_es: En esta sección necesita una nueva revisión.

source: While that group may still be found on some news servers, it is unwise to use it, because postings there will not appear on news servers which honour the official list of group names.
es_es: Aún lo encontrará en algunos servidores de noticias, pero no debe usarlo, ya que lo que publique allí no aparecerá en los servidores de noticias que respetan la lista oficial de nombres de grupos.

source: =head2 I don't have a C compiler.
es_es: =head2 No dispongo de un compilador de C.

source: Unless otherwise stated the ARG argument is optional; in some cases, it is forbidden.
es_es: A menos que se indique lo contrario el argumento ARG es opcional; y en algunos casos, está prohibido.

source: C<given(EXPR)> will assign the value of EXPR to C<$_> within the lexical scope of the block, so it's similar to
es_es: C<given(EXPR)> asignará el valor de EXPR a C<$_> dentro del ámbito léxico del bloque, algo similar a

source: If the hook is an object, it must provide an INC method that will be called as above, the first parameter being the object itself.
es_es: Si el enganche es un objeto, debe proporcionar un método INC que será llamado como antes, el primer parámetro siendo el objeto mismo.

source: Send omissions or corrections to <F<perlbug@perl.org>>.
es_es: Envíe omisiones o correcciones a <F<perlbug@perl.org>>.

source: =head2 Bitwise Or and Exclusive Or X<operator, bitwise, or> X<bitwise or> X<|> X<operator, bitwise, xor> X<bitwise xor> X<^>
es_es: =head2 Or y exclusivo or binarios X<operator, bitwise, or> X<bitwise or> X<|> X<operator, bitwise, xor> X<operador, binario, or> X<binario or> X<operador, binario, xor> X<binario xor>

source: This function places an advisory lock on a shared variable or referenced object contained in I<THING> until the lock goes out of scope.
es_es: Esta función coloca un bloqueo sobre una variable compartida, o un objeto referenciado contenido en I<COSA> hasta que el bloqueo salga del ámbito.

source: =head2 New B<-E> command-line switch
es_es: =head2 Nueva opción en línea de comandos B<-E>
